const inputs = {
    monument: [
        {"Ονομασία": true},
        {"Είδος": true},
        {"Υποείδος": false},
        {"Σύντομη Περιγραφή": true},
        {radio: ["Δημοσιευμένο","Αδημοσίευτο"]}, // <-- Προσθήκη/Αφαίρεση επιλογών
        {"Περιοχή": true},
        {"Θέση": true},
        {"Πρόσβαση": true},
        {"Συντεταγμένες": true},
        {"Υψόμετρο": true},
        {"Διασύνδεση με χάρτες": true},
    ],
    dating: [
        {"Περίοδος" : 
            {
                required: true,
                from: '',
                until: ''
            },
        },
        {"Υποπερίοδος" : 
            {
                required: true,
                from: '',
                until: ''
            },    
        },
        {"Χρονολογία": 
            {
                data: ''
            }
        },
        {radio: ["Βεβαιη","Πιθανολογούμενη","Άγνωστη"]}  // <-- Προσθήκη/Αφαίρεση επιλογών                  
    ],
    functionalityUsage: [
        {"Λειτουργία/Χρήση": 
            {
                "Λειτουργία": ["Αμυντική","Λατρευτική","Ταφική","Οικιστική","Επαγγελματική"],
                "Χρήση": ["Βέβαιη","Πιθανολογούμενη","Άγνωστη"]
            }
        }
    ],
    detailsOfConstruction: [
        {"Αρχιτεκτονικός τύπος": ["value1","value2","value3"]}, // <-- Προσθήκη/Αφαίρεση επιλογών
        {"Κάτοψη": ["value1","value2","value3"]}, // <-- Προσθήκη/Αφαίρεση επιλογών
        {"Στέγαση": ["value1","value2","value3"]}, // <-- Προσθήκη/Αφαίρεση επιλογών
        {"Τοιχοποιία": ["value1","value2","value3"]}, // <-- Προσθήκη/Αφαίρεση επιλογών
        {"Διαστάσεις": true},
        {"Παρατηρήσεις": false},        
    ],
    decorations: [
        {"Στοιχεία διακόσμησης": ["Ζωγραφική","Γλυπτή","Εγχάρακτη","Ψηφιδωτή"]},
        "Παρατηρήσεις",
        {"Λοιπά στοιχεία": ["Οικόσημα","Επιγραφές"]},
        "Παρατηρήσεις",
        {"Κατάσταση διατήρησης": ["value1","value2"]},
        "Επεμβάσεις συντήρησης",        
    ],
    thesmikoPlaisio: [
        {"Κήρυξη": true},
        {"Φορέας προστασίας": ["value1","value2","value3"]}, // <-- Προσθήκη/Αφαίρεση επιλογών
        {"Ιδιοκτησιακό καθεστώς χώρου": ["value1","value2","value3"]}, // <-- Προσθήκη/Αφαίρεση επιλογών
        {"Στοιχεία ιδιοκτησίας": true},
        "Σχόλια/παρατηρήσεις",
        {"Οργανωμένος αρχ/κός χώρος": 
            {
                radio: ["NAI","OXI"]
            }
        },
        {"Επισκέψιμος αρχ/κός χώρος":
            {
                radio: ["NAI","OXI"]
            }
        }
    ],
    files: [
        "Φωτογραφική τεκμηρίωση:",
        "Σχεδιαστική τεκμηρίωση",
        "Βίντεο"
    ],
    relationships: [
        "Κινητά μνημεία-ευρήματα",
        "Κινητά μνημεία-ευρήματα"
    ]
}

export default inputs;